## Plan Result (demo-backendappgateway)




<pre><code>Plan: 5 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-bookings-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-notification-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-test-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-user-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-video-api&#34;]
* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw"
        name                              = "aks00-demo-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (7 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.51.95.250",
            ]
          + name         = "vh-bookings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.51.95.250",
            ]
          + name         = "vh-notification-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.51.95.250",
            ]
          + name         = "vh-test-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.51.95.250",
            ]
          + name         = "vh-user-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.51.95.250",
            ]
          + name         = "vh-video-api"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/dummy-app" -> null
          - name                                = "dummy-app" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/dummy-app" -> null
          - probe_name                          = "dummy-app" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-bookings-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-bookings-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-notification-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-notification-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-test-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-test-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-user-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-user-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-video-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-video-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/dummy-app"
          + name                                = "dummy-app"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/dummy-app"
          + probe_name                          = "dummy-app"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "dummy-app.demo.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/dummy-app" -> null
          - name                           = "dummy-app" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-bookings-api.demo.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-bookings-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-demo-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-notification-api.demo.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-notification-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-demo-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-test-api.demo.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-test-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-demo-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-user-api.demo.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-user-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-demo-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-video-api.demo.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-video-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-demo-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "dummy-app.demo.platform.hmcts.net"
          + host_names                     = []
          + id                             = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/dummy-app"
          + name                           = "dummy-app"
          + protocol                       = "Http"
        }

      - probe {
          - host                                      = "dummy-app.demo.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/dummy-app" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "dummy-app" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [] -> null
            }
        }
      + probe {
          + host                                      = "dummy-app.demo.platform.hmcts.net"
          + id                                        = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/dummy-app"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "dummy-app"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-bookings-api.demo.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-bookings-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-notification-api.demo.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-notification-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-test-api.demo.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-test-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-user-api.demo.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-user-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-video-api.demo.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-video-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/dummy-app" -> null
          - backend_address_pool_name  = "dummy-app" -> null
          - backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/dummy-app" -> null
          - backend_http_settings_name = "dummy-app" -> null
          - http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/dummy-app" -> null
          - http_listener_name         = "dummy-app" -> null
          - id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/dummy-app" -> null
          - name                       = "dummy-app" -> null
          - priority                   = 10 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/dummy-app"
          + backend_address_pool_name  = "dummy-app"
          + backend_http_settings_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/dummy-app"
          + backend_http_settings_name = "dummy-app"
          + http_listener_id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/dummy-app"
          + http_listener_name         = "dummy-app"
          + id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/dummy-app"
          + name                       = "dummy-app"
          + priority                   = 10
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-bookings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-bookings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-bookings-api"
          + id                         = (known after apply)
          + name                       = "vh-bookings-api"
          + priority                   = 60
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-notification-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-notification-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-notification-api"
          + id                         = (known after apply)
          + name                       = "vh-notification-api"
          + priority                   = 50
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-test-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-test-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-test-api"
          + id                         = (known after apply)
          + name                       = "vh-test-api"
          + priority                   = 40
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-user-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-user-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-user-api"
          + id                         = (known after apply)
          + name                       = "vh-user-api"
          + priority                   = 20
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-video-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-video-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-video-api"
          + id                         = (known after apply)
          + name                       = "vh-video-api"
          + priority                   = 30
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (11 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-bookings-api"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-bookings-api"
      + records             = [
          + "10.51.96.132",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-notification-api"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-notification-api"
      + records             = [
          + "10.51.96.132",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-test-api"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-test-api"
      + records             = [
          + "10.51.96.132",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-user-api"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-user-api"
      + records             = [
          + "10.51.96.132",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-video-api"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-video-api"
      + records             = [
          + "10.51.96.132",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "demo.platform.hmcts.net"
    }

Plan: 5 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":353,"Program":"tfcmt","SHA1":"","Target":"demo-backendappgateway","Vars":{}} -->